
===========================================================================
report_tns
============================================================================
tns -11.32

===========================================================================
report_wns
============================================================================
wns -0.28

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -0.28

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.22
