
===========================================================================
report_tns
============================================================================
tns -2.16

===========================================================================
report_wns
============================================================================
wns -0.65

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -0.65

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack -1.36
