
===========================================================================
report_tns
============================================================================
tns -322.74

===========================================================================
report_wns
============================================================================
wns -8.51

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -8.51

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack -0.03
