
===========================================================================
report_tns
============================================================================
tns -328.19

===========================================================================
report_wns
============================================================================
wns -5.56

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -5.56

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.07
