
===========================================================================
report_tns
============================================================================
tns -292.62

===========================================================================
report_wns
============================================================================
wns -8.17

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -8.17

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack -0.03
