
===========================================================================
report_tns
============================================================================
tns 0.00

===========================================================================
report_wns
============================================================================
wns 0.00

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack 1.20

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.11
