
===========================================================================
report_tns
============================================================================
tns -365.24

===========================================================================
report_wns
============================================================================
wns -8.93

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -8.93

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack -0.03
