
===========================================================================
report_tns
============================================================================
tns -302.11

===========================================================================
report_wns
============================================================================
wns -5.09

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -5.09

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.06
