
===========================================================================
report_tns
============================================================================
tns -36.35

===========================================================================
report_wns
============================================================================
wns -2.19

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -2.19

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack -0.97
