
===========================================================================
report_tns
============================================================================
tns -3.52

===========================================================================
report_wns
============================================================================
wns -0.25

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -0.25

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.23
