
===========================================================================
report_tns
============================================================================
tns -315.67

===========================================================================
report_wns
============================================================================
wns -5.34

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -5.34

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.07
