get_yosys_bin
convert_pg_pins
run_yosys
run_sta
run_synth_exploration
run_synthesis
verilog_elaborate
yosys_rewrite_verilog
logic_equiv_check
verilog_to_verilogPower
write_powered_verilog
run_lvs
run_netgen
run_lef_cvc
run_magic
run_magic_drc
run_magic_spice_export
export_magic_view
run_magic_antenna_check
copy_gds_properties
global_placement
global_placement_or
random_global_placement
detailed_placement
add_macro_placement
manual_macro_placement
detailed_placement_or
basic_macro_placement
run_placement
repair_wire_length
run_openPhySyn
init_design
global_routing_or
global_routing
detailed_routing
ins_fill_cells_or
ins_fill_cells
power_routing
gen_pdn
ins_diode_cells_1
ins_diode_cells_4
add_route_obs
run_spef_extraction
run_routing
check_assign_statements
check_synthesis_failure
check_floorplan_missing_lef
check_floorplan_missing_pins
check_cts_clock_nets
check_replace_divergence
check_macro_placer_num_solns
set_netlist
set_def
prep_lefs
trim_lib
source_config
prep
padframe_gen
padframe_gen_legacy
save_views
heal_antenna_violators
li1_hack_start
li1_hack_end
widen_site_width
use_widened_lefs
use_original_lefs
label_macro_pins
write_verilog
add_macro_obs
set_layer_tracks
run_or_antenna_check
run_antenna_check
set_core_dims
simple_cts
run_cts
init_floorplan_or
init_floorplan
place_io_ol
place_io
place_contextualized_io
tap_decap_or
padframe_extract_area
chip_floorplan
apply_def_template
run_power_grid_generation
run_floorplan
