set_def
prep 
run_cts 
run_magic 
global_placement 
detailed_placement 
run_placement 
init_design 
init_floorplan 
place_io 
gen_pdn 
tap_decap 
run_floorplan 
global_routing 
detailed_routing 
ins_fill_cells 
run_routing 
set_core_dims 
gen_cts_config 
gen_clock_tree 
simple_cts 
run_yosys 
run_synthesis 

