
===========================================================================
report_tns
============================================================================
tns -335.83

===========================================================================
report_wns
============================================================================
wns -8.62

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -8.62

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack -0.03
