
===========================================================================
report_tns
============================================================================
tns -354.84

===========================================================================
report_wns
============================================================================
wns -8.85

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -8.85

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack -0.02
