
===========================================================================
report_tns
============================================================================
tns -77.79

===========================================================================
report_wns
============================================================================
wns -1.47

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -1.47

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.24
