
===========================================================================
report_tns
============================================================================
tns 0.00

===========================================================================
report_wns
============================================================================
wns 0.00

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack 2.26

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.05
