
===========================================================================
report_tns
============================================================================
tns -397.28

===========================================================================
report_wns
============================================================================
wns -9.27

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -9.27

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack -0.03
